#!/bin/bash

DIR="$(pwd)"
FILE="$DIR/$2"

case "$1" in
    add)
        echo "$(date +%F) $3 $4 $5" >> "$FILE"
        echo "added"
        ;;
    list)
        cat "$FILE"
        ;;
    *)
        echo "usage: $0 add <filename> <category> <sum> <deskription>| $0 list <filename>"
        ;;
esac

#12. Система учета расходов:
#Описание: Создайте скрипт, который позволяет пользователю добавлять и просматривать записи о расходах. 
#Требования: 
#- Скрипт должен сохранять данные в текстовом файле
#- Имя файла передавать в аргументах командной строки
#- Добавление новой записи реализовать в отдельной функции. Каждая запись должна включать дату, категорию расхода, сумму и описание. 
